Revit 2024 API
TableCellStyleOverrideOptions.TextOrientation Property
 Indicates if the text orientation characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool TextOrientation { get; set; }
Visual Basic
Public Property TextOrientation As Boolean
	Get
	Set
Visual C++
public:
property bool TextOrientation {
	bool get ();
	void set (bool value);
}
See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace